



6lo                                                      P. Thubert, Ed.
Internet-Draft                                                     cisco
Intended status: Standards Track                              C. Perkins
Expires: March 7, 2019                                         Futurewei
                                                       September 3, 2018


                          IPv6 Backbone Router
                   draft-ietf-6lo-backbone-router-07

Abstract

   Backbone Routers placed at the wireless edge of a backbone link
   interconnect multiple wireless links at Layer-3 to form a large
   MultiLink Subnet, so that the broadcast domain of the backbone does
   not extend to the wireless links.  Wireless nodes register or are
   proxy-registered to a Backbone Router to establish IPv6 Neighbor
   Discovery proxy services, and the Backbone Router takes care of the
   ND operation on behalf of registered nodes and ensures and routes
   towards the registered addresses over the wireless interface.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on March 7, 2019.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect



Thubert & Perkins         Expires March 7, 2019                 [Page 1]

Internet-Draft            IPv6 Backbone Router            September 2018


   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Applicability and Requirements Served . . . . . . . . . . . .   4
   3.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   5
   4.  Overview  . . . . . . . . . . . . . . . . . . . . . . . . . .   7
   5.  Backbone Router Routing Operations  . . . . . . . . . . . . .   8
     5.1.  Over the Backbone Link  . . . . . . . . . . . . . . . . .   9
     5.2.  Over the LLN Link . . . . . . . . . . . . . . . . . . . .  10
   6.  Backbone Router Proxy Operations  . . . . . . . . . . . . . .  11
     6.1.  Registration and Binding State Creation . . . . . . . . .  14
     6.2.  Defending Addresses . . . . . . . . . . . . . . . . . . .  15
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .  16
   8.  Protocol Constants  . . . . . . . . . . . . . . . . . . . . .  16
   9.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  17
   10. Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  17
   11. References  . . . . . . . . . . . . . . . . . . . . . . . . .  17
     11.1.  Normative References . . . . . . . . . . . . . . . . . .  17
     11.2.  Informative References . . . . . . . . . . . . . . . . .  18
     11.3.  External Informative References  . . . . . . . . . . . .  22
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  22

1.  Introduction

   One of the key services provided by IEEE STD. 802.1 [IEEEstd8021]
   Ethernet Bridging is an efficient and reliable broadcast service, and
   multiple applications and protocols have been built that heavily
   depend on that feature for their core operation.  Unfortunately, a
   wide range of wireless networks do not provide economical broadcast
   capabilities of Ethernet Bridging; protocols designed for bridged
   networks that rely on broadcast often exhibit disappointing
   behaviours when applied unmodified to a wireless medium.

   Wi-Fi [IEEEstd80211] Access Points (APs) deployed in an Extended
   Service Set (ESS) act as bridges.  However, in order to ensure a
   solid connectivity to the devices and protect the medium against
   harmful broadcasts, they refrain from relying on broadcast-intensive
   protocols such as Transparent Bridging on the wireless side.
   Instead, an association process is used to register proactively the
   MAC addresses of the wireless device (STA) to the AP.  Then, the APs
   proxy the bridging operation and cancel the broadcasts.





Thubert & Perkins         Expires March 7, 2019                 [Page 2]

Internet-Draft            IPv6 Backbone Router            September 2018


   The IPv6 [RFC8200] Neighbor Discovery [RFC4861] [RFC4862] Protocol
   (NDP) operations are reactive and rely heavily on multicast
   transmissions to locate an on-link correspondent and ensure address
   uniqueness.  When the Duplicate Address Detection [RFC4862] (DAD)
   mechanism was designed, it was a natural match with the efficient
   broadcast operation of Ethernet Bridging.  However, since broadcast
   can be unreliable over wireless media, DAD often fails to discover
   duplications [I-D.yourtchenko-6man-dad-issues].  DAD usually appears
   to work on wireless media, not because address duplication is
   detected and solved as designed, but because the use of 64-bit
   Interface IDs makes duplication into a very rare event.

   IPv6 multicast messages are usually broadcast over the wireless
   medium.  They are processed by most if not all wireless nodes over
   the ESS fabric even when very few if any of the nodes are subscribed
   to the multicast address.  Consequently a simple Neighbor
   Solicitation (NS) lookup message [RFC4861], that is supposedly
   targeted to a very small group of nodes, can consume the whole
   wireless bandwidth across the fabric
   [I-D.vyncke-6man-mcast-not-efficient].  The reactive IPv6 ND
   operation leads to undesirable power consumption in battery-operated
   devices.

   The inefficiencies of using radio broadcasts to support IPv6 NDP
   suggest restricting broadcast transmissions over the wireless access
   links.  This can be done by splitting the subnet in multiple ones,
   and in extreme cases providing a /64 per wireless device.  Another
   way is to take over (proxy) the Layer-3 protocols that rely on
   broadcast operation at the boundary of the wired and wireless
   domains, emulating the Layer-2 association at Layer-3.  Indeed, the
   IEEE STD. 802.11 [IEEEstd80211] specifications require ARP and ND
   proxy [RFC4389] functions at the Access Points (APs) but the
   specification for the ND proxy operations is still missing.

   Current devices rely on snooping for detecting association state,
   which is unsatisfactory in a lossy and mobile conditions.  With
   snooping, a state (e.g. a new IPv6 address) may not be discovered or
   a change of state (e.g. a movement) may be missed, leading to
   unreliable connectivity.

   WPAN devices (i.e., those implementing IEEE STD. 802.15.4
   [IEEEstd802154]) can make use of Neighbor Discovery Optimization for
   IPv6 over Low-Power Wireless Personal Area Networks (6LoWPANs)
   [RFC6775] which treats the wireless medium as different from
   Ethernet.  RFC 6775 is updated as [I-D.ietf-6lo-rfc6775-update]; the
   update includes changes that are required by this document.





Thubert & Perkins         Expires March 7, 2019                 [Page 3]

Internet-Draft            IPv6 Backbone Router            September 2018


   This specification applies to other wireless links such as Low-Power
   IEEE STD. 802.11 (Wi-Fi) and IEEE STD. 802.15.1 (Bluetooth)
   [IEEEstd802151], and extends [RFC6775] to enable proxy operation by
   the 6BBR.  The proxy operation on the BBR eliminates the need for
   low-power nodes or nodes that are deep in a mesh to respond
   synchronously when a lookup is performed for their addresses.  This
   provides the function of a Sleep Proxy for ND
   [I-D.nordmark-6man-dad-approaches].

2.  Applicability and Requirements Served

   Efficiency aware IPv6 Neighbor Discovery Optimizations
   [I-D.chakrabarti-nordmark-6man-efficient-nd] suggests that 6LoWPAN ND
   [RFC6775] can be extended to other types of links beyond IEEE STD.
   802.15.4 for which it was defined.  The registration technique is
   beneficial when the Link-Layer technique used to carry IPv6 multicast
   packets has poor delivery ratio or requires high energy consumption
   in the end devices, all the more in use cases that involve mobility.

   This specification updates and generalizes 6LoWPAN ND to a broader
   range of Low power and Lossy Networks (LLNs) with support for
   Duplicate Address Detection (DAD) and address lookup that does not
   require broadcasts over the LLNs.  The term LLN is used loosely in
   this specification to cover multiple types of WLANs and WPANs,
   including Low-Power Wi-Fi, BLUETOOTH(R) Low Energy, IEEE STD.
   802.11AH and IEEE STD. 802.15.4 wireless meshes, so as to address the
   requirements listed in Appendix B.3 of [I-D.ietf-6lo-rfc6775-update]
   "Requirements Related to the Variety of Low-Power Link types".

   The scope of this draft is a Backbone that enable the federation of
   multiple LLNs into a IPv6 MultiLink Subnet.  Each LLN in the subnet
   is anchored at an IPv6 Backbone Router (6BBR).  The Backbone Routers
   interconnect the LLNs and advertise the addresses of the LLN nodes
   using proxy-ND operations.  This specification extends IPv6 ND over
   the backbone to distinguish address movement from duplication and
   eliminate stale state in the backbone routers and backbone nodes once
   a LLN node has roamed.  In this way, mobile nodes may roam rapidly
   from one 6BBR to the next and requirements in Appendix B.1 of
   [I-D.ietf-6lo-rfc6775-update]"Requirements Related to Mobility" are
   met.

   This specification can be used by any wireless node to associate at
   Layer-3 with a 6BBR and register its IPv6 addresses to obtain routing
   services including proxy-ND operations over the backbone, providing a
   solution to the requirements expressed in Appendix B.4 of
   [I-D.ietf-6lo-rfc6775-update] "Requirements Related to Proxy
   Operations".




Thubert & Perkins         Expires March 7, 2019                 [Page 4]

Internet-Draft            IPv6 Backbone Router            September 2018


   The Link Layer Address (LLA) that is returned as Target LLA (TLLA) in
   Neighbor Advertisements (NA) messages by the 6BBR on behalf of the
   Registered Node over the backbone may be that of the Registering
   Node.  In that case, the 6BBR needs to bridge the unicast packets
   (Bridging proxy), or that of the 6BBR on the backbone, in which case
   the 6BBRs needs to route the unicast packets (Routing proxy).  In the
   latter case, the 6BBR maintains the list of correspondents to which
   it has advertised its own MAC address on behalf of the LLN node.  The
   IPv6 ND operation is minimized as the number of nodes scale up in the
   LLN.  This meets the requirements in Appendix B.6 of
   [I-D.ietf-6lo-rfc6775-update] "Requirements Related to Scalability",
   as long has the 6BBRs are dimensioned for the number of registrations
   that each needs to support.

   For the TimeSlotted Channel Hopping (TSCH) mode of [IEEEstd802154],
   the 6TiSCH architecture [I-D.ietf-6tisch-architecture] describes how
   a 6LoWPAN ND host could connect to the Internet via a RPL mesh
   Network, but doing so requires additions to the 6LOWPAN ND protocol
   to support mobility and reachability in a secure and manageable
   environment.  This document details such additions for the 6TiSCH
   architecture, and serves the requirements listed in Appendix B.2 of
   [I-D.ietf-6lo-rfc6775-update] "Requirements Related to Routing
   Protocols".

   In the case of Low-Power IEEE STD. 802.11, a 6BBR may be collocated
   with a standalone AP or a CAPWAP [RFC5415] wireless controller.  Then
   the wireless client (STA) makes use of this specification to register
   its IPv6 address(es) to the 6BBR over the wireless medium.  In the
   case of a 6TiSCH LLN mesh, the RPL root is collocated with a 6LoWPAN
   Border Router (6LBR), and either collocated with or connected to the
   6BBR over an IPv6 Link.  The 6LBR makes use of this specification to
   register the LLN nodes on their behalf to the 6BBR.  In the case of
   BTLE, the 6BBR is collocated with the router that implements the BTLE
   central role as discussed in section 2.2 of [RFC7668].

3.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   Readers are expected to be familiar with all the terms and concepts
   that are discussed in "Neighbor Discovery for IP version 6"
   [RFC4861], "IPv6 Stateless Address Autoconfiguration" [RFC4862],
   "IPv6 over Low-Power Wireless Personal Area Networks (6LoWPANs):
   Overview, Assumptions, Problem Statement, and Goals" [RFC4919],
   Neighbor Discovery Optimization for Low-power and Lossy Networks




Thubert & Perkins         Expires March 7, 2019                 [Page 5]

Internet-Draft            IPv6 Backbone Router            September 2018


   [RFC6775] and "Multi-link Subnet Support in IPv6"
   [I-D.ietf-ipv6-multilink-subnets].

   Readers would benefit from reading "Multi-Link Subnet Issues"
   [RFC4903], ,"Mobility Support in IPv6" [RFC6275], "Neighbor Discovery
   Proxies (ND Proxy)" [RFC4389] and "Optimistic Duplicate Address
   Detection" [RFC4429] prior to this specification for a clear
   understanding of the art in ND-proxying and binding.

   Additionally, this document uses terminology from [RFC7102],
   [I-D.ietf-6lo-rfc6775-update] and [I-D.ietf-6tisch-terminology], and
   introduces the following terminology:

   Sleeping Proxy

         A 6BBR acts as a Sleeping Proxy if it answers ND Neighbor
         Solicitation over the backbone on behalf of the Registered
         Node.

   Unicasting  Proxy

         A Unicasting Proxy forwards NS messages to the Registering
         Node, transforming Layer-2 multicast into unicast.

   Routing proxy

         A routing proxy advertises its own MAC address, as opposed to
         that of the node that performs the registration, as the TLLA in
         the proxied NAs over the backbone.

   Bridging proxy

         A Bridging proxy advertises the MAC address of the node that
         performs the registration as the TLLA in the proxied NAs over
         the backbone.  In that case, the MAC address and the mobility
         of the node is still visible across the bridged backbone
         fabric.

   Primary BBR

         The BBR that will defend a Registered Address for the purpose
         of DAD over the backbone.

   Secondary BBR

         A BBR other than the Primary BBR to which an address is
         registered.  A Secondary Router MAY advertise the address over
         the backbone and proxy for it.



Thubert & Perkins         Expires March 7, 2019                 [Page 6]

Internet-Draft            IPv6 Backbone Router            September 2018


4.  Overview

   An LLN node can move freely from an LLN anchored at a Backbone Router
   to an LLN anchored at another Backbone Router on the same backbone
   and keep any or all of the IPv6 addresses that it has formed.

                 |
               +-----+
               |     | Gateway (default) Router
               |     |
               +-----+
                  |
                  |      Backbone Link
            +--------------------+------------------+
            |                    |                  |
         +-----+             +-----+             +-----+
         |     | Backbone    |     | Backbone    |     | Backbone
         |     | router      |     | router      |     | router
         +-----+             +-----+             +-----+
            o                o   o  o              o o
        o o   o  o       o o   o  o  o         o  o  o  o o
       o  o o  o o       o   o  o  o  o        o  o  o o o
       o   o  o  o          o    o  o           o  o   o
         o   o o               o  o                 o o

         LLN              LLN              LLN


               Figure 1: Backbone Link and Backbone Routers

   Each Backbone Router (6BBR) maintains a Binding Table of its
   Registered Nodes.  The Binding Table operates as a distributed
   database of wireless Nodes whether they reside on the LLNs or on the
   backbone, and use an extension to the Neighbor Discovery Protocol to
   exchange that information across the Backbone as with IPv6 ND.

   The Extended Address Registration Option (EARO) defined in
   [I-D.ietf-6lo-rfc6775-update] is used to enable the registration for
   routing and proxy options in the ND exchanges over the backbone
   between the 6BBRs to disambiguate duplication from movement.

   Address duplication is detected using the ROVR field in the EARO,
   which is a generalization of the EUI-64 that allows different types
   of unique IDs beyond the name space derived from the MAC addresses.
   First-Come First-Serve rules apply, whether the duplication happens
   between LLN nodes as represented by their respective 6BBRs, or
   between an LLN node and a node that defends its address over the
   backbone with IPv6 ND and does not include the EARO.



Thubert & Perkins         Expires March 7, 2019                 [Page 7]

Internet-Draft            IPv6 Backbone Router            September 2018


   In case of conflicting registrations to multiple 6BBRs from a same
   node, a sequence counter called Transaction ID (TID) in the EARO
   enables 6BBRs to determine the latest registration for that node.
   Registrations with a same TID are compatible and maintained, but, in
   case of different TIDs, only the freshest registration is maintained
   and the stale state is eliminated.  The EARO also transports a 'R'
   flag to be used by a 6LN when registering, to indicate that this 6LN
   is not a router and that it will not handle its own reachability.

   With this specification, Backbone Routers perform a ND proxy
   operation over the Backbone Link on behalf of their Registered Nodes.
   The registration to the proxy service is done with a NS/NA(EARO)
   exchange.  The EARO with a 'R' flag is used in this specification to
   request the 6BBR to perform this proxy operation.  The Backbone
   Router operation is essentially similar to that of a Mobile IPv6
   (MIPv6) [RFC6275] Home Agent.  This enables mobility support for LLN
   nodes that would move outside of the network delimited by the
   Backbone link attach to a Home Agent from that point on.  This also
   enables collocation of Home Agent functionality within Backbone
   Router functionality on the same backbone interface of a router.
   Further specification may extend this be allowing the 6BBR to
   redistribute host routes in routing protocols that would operate over
   the backbone, or in MIPv6 or the Locator/ID Separation Protocol
   (LISP) [RFC6830] to support mobility on behalf of the nodes, etc...

   The Optimistic Duplicate Address Detection [RFC4429] (ODAD)
   specification details how an address can be used before a Duplicate
   Address Detection (DAD) is complete, and insists that an address that
   is TENTATIVE should not be associated to a Source Link-Layer Address
   Option in a Neighbor Solicitation message.  This specification makes
   use of ODAD to create a temporary proxy state in the 6BBR till DAD is
   completed over the backbone.  This way, the specification enables to
   distribute proxy states across multiple 6BBR and co-exist with IPv6
   ND over the backbone.

5.  Backbone Router Routing Operations















Thubert & Perkins         Expires March 7, 2019                 [Page 8]

Internet-Draft            IPv6 Backbone Router            September 2018


                  |
               +-----+
               |     | Gateway (default) Router
               |     |
               +-----+
                  | /64
                  |      Backbone Link
            +-------------------+-------------------+
            | /64               | /64               | /64
         +-----+             +-----+             +-----+
         |     | Backbone    |     | Backbone    |     | Backbone
         |     | router      |     | router      |     | router
         +-----+             +-----+             +-----+
            o N * /128          o M * /128          o P * /128
        o o   o  o       o o   o  o  o         o  o  o  o o
       o  o o  o o       o   o  o  o  o        o  o  o o o
       o   o  o  o          o    o  o           o  o   o
         o   o o               o  o                 o o


    Figure 2: Example Routing Configuration for 3 LLNs in the ML Subnet

5.1.  Over the Backbone Link

   A 6BBR is a specific kind of Border Router that performs proxy
   Neighbor Discovery on its backbone interface on behalf of the nodes
   that it has discovered on its LLN interfaces.

   Some restrictions of the attached LLNs will apply to the backbone.
   In particular, the MTU MUST be set to the same value on the backbone
   and all attached LLNs.  The scalability of the whole subnet requires
   that broadcast operations are avoided as much as possible on the
   backbone as well.  Unless configured otherwise, in the RAs that it
   sends towards the LLN links, the Backbone Router MUST use the same
   MTU that it learns from RAs over the backbone.

   On the backbone side, the 6BBR behaves like any other IPv6 router.
   It advertises on the backbone the prefixes of the LLNs for which it
   serves as a proxy.

   The 6BBR uses an EARO in the NS-DAD and the multicast NA messages
   that it generates over the Backbone Link on behalf of a Registered
   Node, and it places an EARO in its unicast NA messages, if and only
   if the NS/NA that stimulates it had an EARO in it and the 'R' bit
   set.

   The 6BBR SHOULD use unicast or solicited-node multicast address
   (SNMA) [RFC4291] to defend its Registered Addresses over the



Thubert & Perkins         Expires March 7, 2019                 [Page 9]

Internet-Draft            IPv6 Backbone Router            September 2018


   backbone.  In particular, the 6BBR MUST join the SNMA group that
   corresponds to a Registered Address as soon as it creates an entry
   for that address, and as long as it maintains that entry.

   Optimistic DAD (ODAD) [RFC4429] SHOULD be supported by the 6BBRs in
   their proxy activity over the backbone.  A node supporting ODAD MUST
   join the SNMA of a Tentative address.

   A 6BBR in Routing Proxy mode advertises the Registered IPv6 Address
   with the 6BBR Link Layer Address, and updates Neighbor Cache Entries
   (NCE) in correspondent nodes over the backbone, using gratuitous
   NA(Override).  This method may fail if the multicast message is not
   properly received, and correspondent nodes may maintain an incorrect
   neighbor state, which they will eventually discover through Neighbor
   Unreachability Detection (NUD).  For slow movements, the NUD
   procedure defined in [RFC4861] may time out too quickly, and the
   support of [RFC7048] is recommended in all nodes in the network.

   Since the MultiLink Subnet may grow to contain many nodes, multicast
   should be avoided as much as possible even on the backbone.  Though
   hosts can participate using legacy IPv6 ND, all nodes connected to
   the backbone SHOULD support [I-D.ietf-6man-rs-refresh], which also
   requires the support of [RFC7559].

5.2.  Over the LLN Link

   BBRs and LLN hosts on the LLN follow [RFC6775] and do not depend on
   multicast RAs to discover routers.  LLN nodes SHOULD accept multicast
   RAs [RFC7772], but those are rare on the LLN link.  Nodes SHOULD
   follow the Simple Procedures for Detecting Network Attachment in IPv6
   [RFC6059] (DNA procedures) to assert movements, and to support the
   Packet-Loss Resiliency for Router Solicitations [RFC7559] to make the
   unicast RS more reliable.

   LLN node signals that it requires IPv6 ND proxy services from a 6BBR
   by registering the corresponding IPv6 Address with an NS(EARO)
   message with the 'R' flag set.  The LLN node that performs the
   registration (the Registering Node) may be the owner of the IPv6
   Address (the Registered Node) or a 6LBR that performs the
   registration on its behalf.

   When operating as a Routing Proxy, the BBR installs host routes
   (/128) to the Registered Addresses over the LLN links, via the
   Registering Node as identified by the Source Address and the SLLA
   option in the NS(EARO) messages.  In that case, the MAC address of
   the node is not visible at Layer-2 over the backbone and the bridging
   fabric is not aware of the addresses of the LLN devices and their
   mobility.  The 6BBR installs a connected host route towards the



Thubert & Perkins         Expires March 7, 2019                [Page 10]

Internet-Draft            IPv6 Backbone Router            September 2018


   registered node over the interface to the node, and acts as a Layer-3
   router for unicast packets to the node.

   In that mode, the 6BBR handles the ND protocol over the backbone on
   behalf of the Registered Nodes, using its own MAC address in the TLLA
   and SLLA options in proxied NS and NA messages.  For each Registered
   Address, multiple peer Nodes on the backbone may have resolved the
   address with the 6BBR MAC address and store that mapping in their
   Neighbor cache.

   For each Registered Address, the 6BBR SHOULD maintain a list of the
   peers on the backbone which have associated its MAC address with the
   Registered Address.  If that Registered Address moves to a different
   6BBR, the first 6BBR SHOULD unicast a gratuitous NA(Override) to each
   such peer, to supply the MAC address of the new 6BBR in the TLLA
   option for the Address.

   A Bridging Proxy can be implemented in a Layer-3 switch, or in a
   wireless Access Point that acts as an IPv6 Host.  In the latter case,
   the SLLA option in the proxied NA messages is that of the Registering
   Node, and the 6BBR acts as a Layer-2 bridge for unicast packets to
   the Registered Address.  The MAC address in the S/TLLA is that of the
   Registering Node, which is not necessarily the Registered Node.  When
   a device moves within a LLN mesh, it may attach to a different 6LBR
   acting as Registering Node, and the MAC address advertised over the
   backbone will change.

   If a registration moves from one 6BBR to the next, but the
   Registering Node does not change, as indicated by the S/TLLA option
   in the ND exchanges, there is no need to update the Neighbor Caches
   in the peers Nodes on the backbone.  On the other hand, if the LLA
   changes, the 6BBR SHOULD inform all the relevant peers as described
   above, to update the impacted Neighbor Caches.  In the same fashion,
   if the Registering Node changes with a new registration, the 6BBR
   SHOULD also update the impacted Neighbor Caches over the backbone.

6.  Backbone Router Proxy Operations

   This specification enables a Backbone Router to proxy Neighbor
   Discovery operations over the backbone on behalf of the nodes that
   are registered to it, allowing any node on the backbone to reach a
   Registered Node as if it was on-link.  The backbone and the LLNs are
   considered different Links in a MultiLink subnet but the prefix that
   is used may still be advertised as on-link on the backbone to support
   legacy nodes; multicast ND messages are link-scoped and not forwarded
   across the backbone routers.

   By default, a 6BBR operates as a Sleeping Proxy, as follows:



Thubert & Perkins         Expires March 7, 2019                [Page 11]

Internet-Draft            IPv6 Backbone Router            September 2018


   o  Create a new entry in a Binding Table for a new Registered Address
      and ensure that the address is not a duplicate over the backbone

   o  Defend a Registered Address over the backbone using NA messages
      with the Override bit set on behalf of the sleeping node

   o  Advertise a Registered Address over the backbone using NA
      messages, asynchronously or as a response to a Neighbor
      Solicitation messages.

   o  To deliver packets arriving from the LLN, use Neighbor
      Solicitation messages to look up the destination over the
      backbone.

   o  Forward packets between the LLN and the backbone.

   o  Verify liveliness when needed for a stale registration.

   A 6BBR may act as a Sleeping Proxy only for a Registered Address that
   is REACHABLE, or TENTATIVE in which case the answer is delayed.  In
   any other state, the Sleeping Proxy operates as a Unicasting Proxy.

   The 6BBR does not act on ND Messages over the backbone unless they
   are relevant to a Registered Node on the LLN side, saving wireless
   interference.  On the LLN side, the prefixes associated to the
   MultiLink Subnet are presented as not on-link, so address resolution
   for other hosts do not occur.

   As a Unicasting Proxy, the 6BBR forwards NS lookup messages to the
   Registering Node, transforming Layer-2 multicast into unicast.  This
   is not possible in UNREACHABLE state, so the NS messages are
   multicasted, and rate-limited with an exponential back-off to protect
   the medium.  In other states, the messages are forwarded to the
   Registering Node as unicast Layer-2 messages.  In TENTATIVE state,
   the NS message is either held till DAD completes, or dropped.

   The draft introduces the optional concept of primary and secondary
   BBRs.  The primary is the backbone router that has the highest EUI-64
   address of all the 6BBRs that share a registration for a same
   Registered Address, with the same ROVR and same Transaction ID, the
   EUI-64 address being considered as an unsigned 64bit integer.  A
   given 6BBR can be primary for a given address and secondary for
   another address, regardless on whether or not the addresses belong to
   the same node.  The primary Backbone Router is in charge of
   protecting the address for DAD over the Backbone.  Any of the Primary
   and Secondary 6BBR may claim the address over the backbone, since
   they are all capable to route from the backbone to the LLN node; the
   address appears on the backbone as an anycast address.



Thubert & Perkins         Expires March 7, 2019                [Page 12]

Internet-Draft            IPv6 Backbone Router            September 2018


   The Backbone Routers maintain a distributed binding table, using IPv6
   ND over the backbone to detect duplication.  This specification
   requires that:

   1.  Addresses in a LLN that can be reachable from the backbone by way
       of a 6BBR MUST be registered to that 6BBR.

   2.  A Registered Node MUST include the EARO in the NS message when
       registering its addresses to a 6LR.  The 6LR MUST forward the
       EARO unchanged to the 6LBR in the DAR/DAC exchange.  The 6LBR
       MUST propagate the EARO unchanged to 6BBR.

   3.  The 6LR MUST respond with the same EARO in the NA, except for the
       status field.

   A false positive duplicate detection may arise over the backbone, for
   instance if the Registered Address is registered to more than one
   LBR, or if the node has moved.  Both situations are handled by the
   6BBR transparently to the node.  In the former case, one LBR becomes
   primary to defend the address over the backbone while the others
   become secondary and may still forward packets.  In the latter case
   the LBR that receives the newest registration becomes primary.

   Only one node may register a given Address at a particular 6BBR.
   However, that Registered Address may be registered to Multiple 6BBRs
   for higher availability.

   Over the LLN, Binding Table management is as follows:

      De-registrations (newer TID, same ROVR, null Lifetime) are
      accepted and acknowledged with a status of 4; the entry is
      deleted;

      Newer registrations (newer TID, same ROVR, non-null Lifetime) are
      acknowledged with a status of 0 (success); the binding is updated
      with the new TID, the Registration Lifetime and the Registering
      Node; in TENTATIVE state the acknowledgement is held and may be
      overwritten; in other states the Registration-Lifetime timer is
      restarted and the entry is placed in REACHABLE state.

      Identical registrations (same TID, same ROVR) from a same
      Registering Node are acknowledged with a status of 0 (success).
      If they are not identical, an error SHOULD be logged.  In
      TENTATIVE state, the response is held and may be overwritten, but
      it MUST be eventually produced and it carries the result of the
      DAD process;





Thubert & Perkins         Expires March 7, 2019                [Page 13]

Internet-Draft            IPv6 Backbone Router            September 2018


      Older registrations (older TID, same ROVR) from a Registering Node
      are ignored;

      Identical and older registrations (not-newer TID, same ROVR) from
      a different Registering Node are acknowledged with a status of 3
      (moved); this may be rate limited to protect the medium;

      Any registration for a different Registered Node (different ROVR)
      are acknowledged with a status of 1 (duplicate).

6.1.  Registration and Binding State Creation

   Upon receiving a registration for a new address with an NS(EARO) with
   the 'R' bit set, the 6BBR performs DAD over the backbone, placing the
   new address as target in the NS-DAD message.  The EARO from the
   registration MUST be placed unchanged in the NS-DAD message, and an
   Neighbor Cache entry created in TENTATIVE state for a duration of
   TENTATIVE_DURATION.  The NS-DAD message is sent multicast over the
   backbone to the SNMA associated with the registered address, unless
   that operation is known to be costly, and the 6BBR has an indication
   from another source (such as a Neighbor Cache entry) that the
   Registered Address was known on the backbone; in the latter case, an
   NS-DAD message may be sent as a Layer-2 unicast to the MAC Address
   that was associated with the Registered Address.

   In TENTATIVE state after EARO with 'R' bit set:

   1.  The entry is removed if an NA is received over the backbone for
       the Registered Address with no EARO, or with an EARO with a
       status of 1 (duplicate) that indicates an existing registration
       for another LLN node.  The ROVR and TID fields in the EARO
       received over the backbone are ignored.  A status of 1 is
       returned in the EARO of the NA back to the Registering Node;

   2.  The entry is also removed if an NA with an ARO option with a
       status of 3 (moved), or a NS-DAD with an ARO option that
       indicates a newer registration for the same Registered Node, is
       received over the backbone for the Registered Address.  A status
       of 3 is returned in the NA(EARO) back to the Registering Node;

   3.  When a registration is updated but not deleted, e.g. from a newer
       registration, the DAD process on the backbone continues and the
       running timers are not restarted;

   4.  Other NS (including DAD with no EARO) and NA from the backbone
       are not acknowledged in TENTATIVE state.  To cover legacy nodes
       that do not support ODAD, the list of their origins MAY be stored




Thubert & Perkins         Expires March 7, 2019                [Page 14]

Internet-Draft            IPv6 Backbone Router            September 2018


       and then, if the TENTATIVE_DURATION timer elapses, the 6BBR MAY
       send each such legacy node a unicast NA.

   5.  When the TENTATIVE_DURATION timer elapses, a status 0 (success)
       is returned in a NA(EARO) back to the Registering Node(s), and
       the entry goes to REACHABLE state for the Registration Lifetime.
       The 6BBR MUST send a multicast NA(EARO) to the SNMA associated to
       the Registered Address over the backbone with the Override bit
       set so as to take over the binding from other 6BBRs.

6.2.  Defending Addresses

   If a 6BBR has an entry in REACHABLE state for a Registered Address:

   o  If the 6BBR is primary, or does not support the function of
      primary, it MUST defend that address over the backbone upon
      receiving NS-DAD, either if the NS does not carry an EARO, or if
      an EARO is present that indicates a different Registering Node
      (different ROVR).  The 6BBR sends a NA message with the Override
      bit set and the NA carries an EARO if and only if the NS-DAD did
      so.  When present, the EARO in the NA(Override) that is sent in
      response to the NS-DAD(EARO) carries a status of 1 (duplicate),
      and the ROVR and TID fields in the EARO are obfuscated with null
      or random values to avoid network scanning and impersonation
      attacks.

   o  If the 6BBR receives an NS-DAD(EARO) for a newer registration, the
      6BBR updates the entry and the routing state to forward packets to
      the new 6BBR, but keeps the entry REACHABLE.  Afterwards, the 6BBR
      MAY use REDIRECT messages to reroute traffic for the Registered
      Address to the new 6BBR.

   o  If the 6BBR receives an NA(EARO) for a newer registration, the
      6BBR removes its entry and sends a NA(EARO) with a status of 3
      (MOVED) to the Registering Node, if the Registering Node is
      different from the Registered Node.  The 6BBR cleans up existing
      Neighbor Cache Entries in peer nodes as discussed in Section 5.1,
      by unicasting to each such peer, or one broadcast NA(Override).

   o  If the 6BBR receives a NS(LOOKUP) for a Registered Address, it
      answers immediately with an NA on behalf of the Registered Node,
      without polling it.  There is no need of an EARO in that exchange.

   o  When the Registration-Lifetime timer elapses, the entry goes to
      STALE state for a duration of STABLE_STALE_DURATION in LLNs that
      keep stable addresses such as LWPANs, and UNSTABLE_STALE_DURATION
      in LLNs where addresses are renewed rapidly, e.g. for privacy
      reasons.



Thubert & Perkins         Expires March 7, 2019                [Page 15]

Internet-Draft            IPv6 Backbone Router            September 2018


   The STALE state enables tracking of the backbone peers that have a
   Neighbor Cache entry pointing to this 6BBR in case the Registered
   Address shows up later.  If the Registered Address is claimed by
   another node on the backbone, with an NS-DAD or an NA, the 6BBR does
   not defend the address.  In STALE state:

   o  If STALE_DURATION elapses, the 6BBR removes the entry.

   o  Upon receiving an NA(Override) the 6BBR removes its entry and
      sends a NA(EARO) with a status of 4 (removed) to the Registering
      Node.

   o  If the 6BBR receives a NS(LOOKUP) for a Registered Address, the
      6BBR MUST send an NS(NUD) following rules in [RFC7048] to the
      Registering Node targeting the Registered Address prior to
      answering.  If the NUD succeeds, the operation in REACHABLE state
      applies.  If the NUD fails, the 6BBR refrains from answering the
      lookup.  The NUD SHOULD be used by the Registering Node to
      indicate liveness of the Registered Node, if they are different
      nodes.

7.  Security Considerations

   This specification applies to LLNS in which the link layer is
   protected, either by means of physical or IP security for the
   Backbone Link or MAC sublayer cryptography.  In particular, the LLN
   MAC is required to provide secure unicast to/from the Backbone Router
   and secure Broadcast from the Backbone Router in a way that prevents
   tempering with or replaying the RA messages.

   The use of EUI-64 for forming the Interface ID in the link local
   address prevents the usage of Secure ND ([RFC3971] and [RFC3972]) and
   address privacy techniques.  This specification RECOMMENDS the use of
   additional protection against address theft such as provided by
   [I-D.ietf-6lo-ap-nd], which guarantees the ownership of the ROVR.

   When the ownership of the ROVR cannot be assessed, this specification
   limits the cases where the ROVR and the TID are multicasted, and
   obfuscates them in responses to attempts to take over an address.

8.  Protocol Constants

   This Specification uses the following constants:

   TENTATIVE_DURATION:        800 milliseconds

   STABLE_STALE_DURATION:     24 hours




Thubert & Perkins         Expires March 7, 2019                [Page 16]

Internet-Draft            IPv6 Backbone Router            September 2018


   UNSTABLE_STALE_DURATION:   5 minutes

   DEFAULT_NS_POLLING:        3 times

9.  IANA Considerations

   This document has no request to IANA.

10.  Acknowledgments

   Kudos to Eric Levy-Abegnoli who designed the First Hop Security
   infrastructure at Cisco.

11.  References

11.1.  Normative References

   [I-D.ietf-6lo-rfc6775-update]
              Thubert, P., Nordmark, E., Chakrabarti, S., and C.
              Perkins, "Registration Extensions for 6LoWPAN Neighbor
              Discovery", draft-ietf-6lo-rfc6775-update-21 (work in
              progress), June 2018.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC4291]  Hinden, R. and S. Deering, "IP Version 6 Addressing
              Architecture", RFC 4291, DOI 10.17487/RFC4291, February
              2006, <https://www.rfc-editor.org/info/rfc4291>.

   [RFC4429]  Moore, N., "Optimistic Duplicate Address Detection (DAD)
              for IPv6", RFC 4429, DOI 10.17487/RFC4429, April 2006,
              <https://www.rfc-editor.org/info/rfc4429>.

   [RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,
              "Neighbor Discovery for IP version 6 (IPv6)", RFC 4861,
              DOI 10.17487/RFC4861, September 2007,
              <https://www.rfc-editor.org/info/rfc4861>.

   [RFC4862]  Thomson, S., Narten, T., and T. Jinmei, "IPv6 Stateless
              Address Autoconfiguration", RFC 4862,
              DOI 10.17487/RFC4862, September 2007,
              <https://www.rfc-editor.org/info/rfc4862>.






Thubert & Perkins         Expires March 7, 2019                [Page 17]

Internet-Draft            IPv6 Backbone Router            September 2018


   [RFC6059]  Krishnan, S. and G. Daley, "Simple Procedures for
              Detecting Network Attachment in IPv6", RFC 6059,
              DOI 10.17487/RFC6059, November 2010,
              <https://www.rfc-editor.org/info/rfc6059>.

   [RFC6550]  Winter, T., Ed., Thubert, P., Ed., Brandt, A., Hui, J.,
              Kelsey, R., Levis, P., Pister, K., Struik, R., Vasseur,
              JP., and R. Alexander, "RPL: IPv6 Routing Protocol for
              Low-Power and Lossy Networks", RFC 6550,
              DOI 10.17487/RFC6550, March 2012,
              <https://www.rfc-editor.org/info/rfc6550>.

   [RFC6775]  Shelby, Z., Ed., Chakrabarti, S., Nordmark, E., and C.
              Bormann, "Neighbor Discovery Optimization for IPv6 over
              Low-Power Wireless Personal Area Networks (6LoWPANs)",
              RFC 6775, DOI 10.17487/RFC6775, November 2012,
              <https://www.rfc-editor.org/info/rfc6775>.

   [RFC8200]  Deering, S. and R. Hinden, "Internet Protocol, Version 6
              (IPv6) Specification", STD 86, RFC 8200,
              DOI 10.17487/RFC8200, July 2017,
              <https://www.rfc-editor.org/info/rfc8200>.

11.2.  Informative References

   [I-D.chakrabarti-nordmark-6man-efficient-nd]
              Chakrabarti, S., Nordmark, E., Thubert, P., and M.
              Wasserman, "IPv6 Neighbor Discovery Optimizations for
              Wired and Wireless Networks", draft-chakrabarti-nordmark-
              6man-efficient-nd-07 (work in progress), February 2015.

   [I-D.delcarpio-6lo-wlanah]
              Vega, L., Robles, I., and R. Morabito, "IPv6 over
              802.11ah", draft-delcarpio-6lo-wlanah-01 (work in
              progress), October 2015.

   [I-D.ietf-6lo-ap-nd]
              Thubert, P., Sarikaya, B., and M. Sethi, "Address
              Protected Neighbor Discovery for Low-power and Lossy
              Networks", draft-ietf-6lo-ap-nd-07 (work in progress),
              September 2018.

   [I-D.ietf-6lo-nfc]
              Choi, Y., Hong, Y., Youn, J., Kim, D., and J. Choi,
              "Transmission of IPv6 Packets over Near Field
              Communication", draft-ietf-6lo-nfc-10 (work in progress),
              July 2018.




Thubert & Perkins         Expires March 7, 2019                [Page 18]

Internet-Draft            IPv6 Backbone Router            September 2018


   [I-D.ietf-6man-rs-refresh]
              Nordmark, E., Yourtchenko, A., and S. Krishnan, "IPv6
              Neighbor Discovery Optional RS/RA Refresh", draft-ietf-
              6man-rs-refresh-02 (work in progress), October 2016.

   [I-D.ietf-6tisch-architecture]
              Thubert, P., "An Architecture for IPv6 over the TSCH mode
              of IEEE 802.15.4", draft-ietf-6tisch-architecture-14 (work
              in progress), April 2018.

   [I-D.ietf-6tisch-terminology]
              Palattella, M., Thubert, P., Watteyne, T., and Q. Wang,
              "Terms Used in IPv6 over the TSCH mode of IEEE 802.15.4e",
              draft-ietf-6tisch-terminology-10 (work in progress), March
              2018.

   [I-D.ietf-bier-architecture]
              Wijnands, I., Rosen, E., Dolganow, A., Przygienda, T., and
              S. Aldrin, "Multicast using Bit Index Explicit
              Replication", draft-ietf-bier-architecture-08 (work in
              progress), September 2017.

   [I-D.ietf-ipv6-multilink-subnets]
              Thaler, D. and C. Huitema, "Multi-link Subnet Support in
              IPv6", draft-ietf-ipv6-multilink-subnets-00 (work in
              progress), July 2002.

   [I-D.nordmark-6man-dad-approaches]
              Nordmark, E., "Possible approaches to make DAD more robust
              and/or efficient", draft-nordmark-6man-dad-approaches-02
              (work in progress), October 2015.

   [I-D.popa-6lo-6loplc-ipv6-over-ieee19012-networks]
              Popa, D. and J. Hui, "6LoPLC: Transmission of IPv6 Packets
              over IEEE 1901.2 Narrowband Powerline Communication
              Networks", draft-popa-6lo-6loplc-ipv6-over-
              ieee19012-networks-00 (work in progress), March 2014.

   [I-D.vyncke-6man-mcast-not-efficient]
              Vyncke, E., Thubert, P., Levy-Abegnoli, E., and A.
              Yourtchenko, "Why Network-Layer Multicast is Not Always
              Efficient At Datalink Layer", draft-vyncke-6man-mcast-not-
              efficient-01 (work in progress), February 2014.








Thubert & Perkins         Expires March 7, 2019                [Page 19]

Internet-Draft            IPv6 Backbone Router            September 2018


   [I-D.yourtchenko-6man-dad-issues]
              Yourtchenko, A. and E. Nordmark, "A survey of issues
              related to IPv6 Duplicate Address Detection", draft-
              yourtchenko-6man-dad-issues-01 (work in progress), March
              2015.

   [RFC3810]  Vida, R., Ed. and L. Costa, Ed., "Multicast Listener
              Discovery Version 2 (MLDv2) for IPv6", RFC 3810,
              DOI 10.17487/RFC3810, June 2004,
              <https://www.rfc-editor.org/info/rfc3810>.

   [RFC3971]  Arkko, J., Ed., Kempf, J., Zill, B., and P. Nikander,
              "SEcure Neighbor Discovery (SEND)", RFC 3971,
              DOI 10.17487/RFC3971, March 2005,
              <https://www.rfc-editor.org/info/rfc3971>.

   [RFC3972]  Aura, T., "Cryptographically Generated Addresses (CGA)",
              RFC 3972, DOI 10.17487/RFC3972, March 2005,
              <https://www.rfc-editor.org/info/rfc3972>.

   [RFC4389]  Thaler, D., Talwar, M., and C. Patel, "Neighbor Discovery
              Proxies (ND Proxy)", RFC 4389, DOI 10.17487/RFC4389, April
              2006, <https://www.rfc-editor.org/info/rfc4389>.

   [RFC4903]  Thaler, D., "Multi-Link Subnet Issues", RFC 4903,
              DOI 10.17487/RFC4903, June 2007,
              <https://www.rfc-editor.org/info/rfc4903>.

   [RFC4919]  Kushalnagar, N., Montenegro, G., and C. Schumacher, "IPv6
              over Low-Power Wireless Personal Area Networks (6LoWPANs):
              Overview, Assumptions, Problem Statement, and Goals",
              RFC 4919, DOI 10.17487/RFC4919, August 2007,
              <https://www.rfc-editor.org/info/rfc4919>.

   [RFC5415]  Calhoun, P., Ed., Montemurro, M., Ed., and D. Stanley,
              Ed., "Control And Provisioning of Wireless Access Points
              (CAPWAP) Protocol Specification", RFC 5415,
              DOI 10.17487/RFC5415, March 2009,
              <https://www.rfc-editor.org/info/rfc5415>.

   [RFC6275]  Perkins, C., Ed., Johnson, D., and J. Arkko, "Mobility
              Support in IPv6", RFC 6275, DOI 10.17487/RFC6275, July
              2011, <https://www.rfc-editor.org/info/rfc6275>.

   [RFC6282]  Hui, J., Ed. and P. Thubert, "Compression Format for IPv6
              Datagrams over IEEE 802.15.4-Based Networks", RFC 6282,
              DOI 10.17487/RFC6282, September 2011,
              <https://www.rfc-editor.org/info/rfc6282>.



Thubert & Perkins         Expires March 7, 2019                [Page 20]

Internet-Draft            IPv6 Backbone Router            September 2018


   [RFC6830]  Farinacci, D., Fuller, V., Meyer, D., and D. Lewis, "The
              Locator/ID Separation Protocol (LISP)", RFC 6830,
              DOI 10.17487/RFC6830, January 2013,
              <https://www.rfc-editor.org/info/rfc6830>.

   [RFC7048]  Nordmark, E. and I. Gashinsky, "Neighbor Unreachability
              Detection Is Too Impatient", RFC 7048,
              DOI 10.17487/RFC7048, January 2014,
              <https://www.rfc-editor.org/info/rfc7048>.

   [RFC7102]  Vasseur, JP., "Terms Used in Routing for Low-Power and
              Lossy Networks", RFC 7102, DOI 10.17487/RFC7102, January
              2014, <https://www.rfc-editor.org/info/rfc7102>.

   [RFC7217]  Gont, F., "A Method for Generating Semantically Opaque
              Interface Identifiers with IPv6 Stateless Address
              Autoconfiguration (SLAAC)", RFC 7217,
              DOI 10.17487/RFC7217, April 2014,
              <https://www.rfc-editor.org/info/rfc7217>.

   [RFC7428]  Brandt, A. and J. Buron, "Transmission of IPv6 Packets
              over ITU-T G.9959 Networks", RFC 7428,
              DOI 10.17487/RFC7428, February 2015,
              <https://www.rfc-editor.org/info/rfc7428>.

   [RFC7559]  Krishnan, S., Anipko, D., and D. Thaler, "Packet-Loss
              Resiliency for Router Solicitations", RFC 7559,
              DOI 10.17487/RFC7559, May 2015,
              <https://www.rfc-editor.org/info/rfc7559>.

   [RFC7668]  Nieminen, J., Savolainen, T., Isomaki, M., Patil, B.,
              Shelby, Z., and C. Gomez, "IPv6 over BLUETOOTH(R) Low
              Energy", RFC 7668, DOI 10.17487/RFC7668, October 2015,
              <https://www.rfc-editor.org/info/rfc7668>.

   [RFC7772]  Yourtchenko, A. and L. Colitti, "Reducing Energy
              Consumption of Router Advertisements", BCP 202, RFC 7772,
              DOI 10.17487/RFC7772, February 2016,
              <https://www.rfc-editor.org/info/rfc7772>.

   [RFC8105]  Mariager, P., Petersen, J., Ed., Shelby, Z., Van de Logt,
              M., and D. Barthel, "Transmission of IPv6 Packets over
              Digital Enhanced Cordless Telecommunications (DECT) Ultra
              Low Energy (ULE)", RFC 8105, DOI 10.17487/RFC8105, May
              2017, <https://www.rfc-editor.org/info/rfc8105>.






Thubert & Perkins         Expires March 7, 2019                [Page 21]

Internet-Draft            IPv6 Backbone Router            September 2018


   [RFC8163]  Lynn, K., Ed., Martocci, J., Neilson, C., and S.
              Donaldson, "Transmission of IPv6 over Master-Slave/Token-
              Passing (MS/TP) Networks", RFC 8163, DOI 10.17487/RFC8163,
              May 2017, <https://www.rfc-editor.org/info/rfc8163>.

11.3.  External Informative References

   [IEEEstd8021]
              IEEE standard for Information Technology, "IEEE Standard
              for Information technology -- Telecommunications and
              information exchange between systems Local and
              metropolitan area networks Part 1: Bridging and
              Architecture".

   [IEEEstd80211]
              IEEE standard for Information Technology, "IEEE Standard
              for Information technology -- Telecommunications and
              information exchange between systems Local and
              metropolitan area networks-- Specific requirements Part
              11: Wireless LAN Medium Access Control (MAC) and Physical
              Layer (PHY) Specifications".

   [IEEEstd802151]
              IEEE standard for Information Technology, "IEEE Standard
              for Information Technology - Telecommunications and
              Information Exchange Between Systems - Local and
              Metropolitan Area Networks - Specific Requirements. - Part
              15.1: Wireless Medium Access Control (MAC) and Physical
              Layer (PHY) Specifications for Wireless Personal Area
              Networks (WPANs)".

   [IEEEstd802154]
              IEEE standard for Information Technology, "IEEE Standard
              for Local and metropolitan area networks -- Part 15.4:
              Low-Rate Wireless Personal Area Networks (LR-WPANs)".

Authors' Addresses

   Pascal Thubert (editor)
   Cisco Systems, Inc
   Building D
   45 Allee des Ormes - BP1200
   MOUGINS - Sophia Antipolis  06254
   FRANCE

   Phone: +33 497 23 26 34
   Email: pthubert@cisco.com




Thubert & Perkins         Expires March 7, 2019                [Page 22]

Internet-Draft            IPv6 Backbone Router            September 2018


   Charles E. Perkins
   Futurewei
   2330 Central Expressway
   Santa Clara  95050
   United States of America

   Email: charliep@computer.org












































Thubert & Perkins         Expires March 7, 2019                [Page 23]
